## Plan for org_account/roles
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_iam_policy.org_account_list_in_sandbox`                     |
|        | `aws_iam_policy.sre_bot_policy`                                  |
|        | `aws_iam_role.sre_bot`                                           |
|        | `aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox` |
|        | `aws_iam_role_policy_attachment.sre_bot`                         |
|        | `module.OIDC_Roles.aws_iam_role.this[&quot;listAccountsInOrg&quot;]`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.org_account_list_in_sandbox will be created
  + resource "aws_iam_policy" "org_account_list_in_sandbox" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "listAccountsInOrg"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:ListAccountsForParent"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/ou-5gsq-qhvjdryl"
                      + Sid      = "ListAccountsInSandboxOU"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.sre_bot_policy will be created
  + resource "aws_iam_policy" "sre_bot_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "sre_bot_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:ListAccounts"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadOrgAccounts"
                    },
                  + {
                      + Action   = "ce:GetCostAndUsage"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ReadCostExplorer"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.sre_bot will be created
  + resource "aws_iam_role" "sre_bot" {
      + arn                   = (known after apply)
      + assume_role_policy    = (sensitive)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sre_bot_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.attach_list_accounts_in_sandbox will be created
  + resource "aws_iam_role_policy_attachment" "attach_list_accounts_in_sandbox" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "listAccountsInOrg"
    }

  # aws_iam_role_policy_attachment.sre_bot will be created
  + resource "aws_iam_role_policy_attachment" "sre_bot" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sre_bot_role"
    }

  # module.OIDC_Roles.aws_iam_role.this["listAccountsInOrg"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = [
                                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::659087519042:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "listAccountsInOrg"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list_in_sandbox"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
